Revit 2027 API
Ceramic.CeramicPattern Property
 The property labeled "Relief Pattern" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CeramicPattern { get; }
Public Shared ReadOnly Property CeramicPattern As String
	Get
public:
static property String^ CeramicPattern {
	String^ get ();
}
static member CeramicPattern : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicPatternType".
See Also
Reference
Ceramic Class
Autodesk.Revit.DB.Visual Namespace